{"pages":[{"title":"UDOO Bolt Docs","text":"","tags":"","url":"index.html"},{"title":"Introduction","text":"UDOO Bolt UDOO Bolt is a portable, breakthrough supercomputer that goes up to 3.6 GHz thanks to the brand-new AMD Ryzen™ Embedded V1000 SoC, a top-notch APU, multicore CPU with powerful integrated mobile GPU - AMD Radeon™ Vega 8 or AMD Radeon™ Vega 3 Graphics - and an integrated Arduino™ Leonardo-compatible platform, all wrapped into one. On UDOO Bolt you can run all the software available for the PC world, from gaming to video streaming, from graphical editors to professional development platforms, plus all the software for the Arduino™ Leonardo world, including all the sketches, libraries and the official Arduino™ IDE. UDOO Bolt embeds two processors: the new AMD Ryzen™ Embedded V1000, V1605B or 1202B, 14nm, up to a 4-cores\/8-threads CPU, with a thermal design power of just 12-25W, designed for really fast Ultrathin Notebooks. This processor family brings together the breakthrough performance of the pioneering AMD “Zen” CPU and AMD “Vega” GPU architectures in a seamlessly-integrated SoC solution that sets a new standard in processing power for next-generation embedded designs. the Atmel® ATmega32U4 8-bit AVR microcontroller, the same of Arduino™ Leonardo. While the AMD Ryzen™ Embedded V1000 processor can run all the Windows 10 and Linux 64bit Distros you want to use as desktop PC, the Atmel® ATmega32U4 allows easy access to a Arduino™ Leonardo environment. Download the User Manual to have more complete explanation of the UDOO BOLT hardware and features. Heads up! In order to prevent damages to your board, remember to: CE and FCC certifications retained using only the UDOO BOLT qualified Power Supply. When not using UDOO Bolt qualified Power Supply, use 19VDC (min 60W power) PSUs certified for your country (make sure that the power cable is less than 3 mt. long). CE and FCC certifications retained with the board inside the UDOO BOLT metal case. When not available, we suggest using a case with the same attributes as the UDOO BOLT metal Case. This product should be operated in a well-ventilated environment and, if used inside a case, the case should not be covered. This product should be elevated on a stable, flat, electrically non-conductive surface whilst in operation, and clear from any object that can induce a short-circuit. Do not expose it to water, moisture or heat from any source; UDOO BOLT is designed for reliable operation at normal ambient room temperatures. Avoid handling the warm and moving parts (like the fan) and generally the printed circuit board while it is powered. Only handle by the edges to minimise the risk of electrostatic discharge damage. Take care whilst handling to avoid mechanical or electrical damage to the printed circuit board and connectors. Also use a grounded wrist strap or touch a safely grounded object before you handle components. Never provide more than 5V in input to the GPIOs of the Arduino Leonardo(Atmel® ATmega32U4), and never provide more than 3.3V in input to the GPIOs of the Embedded Controller. Do not use a NON-standard USB 3.0 peripheral. If you use a non-standard USB 3.0 peripheral with an external power plug, this could send back the power source to the UDOO Bolt board with the risk of damage. The most important safety rule of all: Always Be Careful! (ABC) Lineup UDOO Bolt retail line up consists of two models. Technical specifications Processor: CPU AMD Ryzen™ Embedded V1605B SoC up to 3.6 GHz (V8 version) CPU AMD Ryzen™ Embedded V1202B SoC up to 3.2 GHz (V3 version) GPU: AMD Radeon™ Vega 8 Graphics - 8 GPU Compute Units (V8 version) AMD Radeon™ Vega 3 Graphics - 3 GPU Compute Units (V3 version) RAM: 2x Slot SO-DIMM Dual-channel 64-bit DDR4 2400 MT\/s with ECC support up to 32GB Atmel® ATmega32U4 8-bit AVR RISC-based microcontroller. Video interfaces: 2x HDMI 1.4\/2.0a 2x USB Type-C (DP alternate mode) Storage: 1x 32GB eMMC 5.0 High Speed Drive 1x SSD SATA module's Slot M.2 Socket 2 Key B 2242\/2260 (featured also PCI-e x2) 1x NVMe modules Slot M.2 Socket 3 Key M 2280 (PCI-e x4 Gen 3 interface) 1x SATA III 6Gbit\/s standard connector Networking: 1x Gigabit Ethernet LAN interface 1x M.2 Key E slot for optional Wireless(WiFi+BT) combo module Audio interfaces: HD Audio Codec Realtek ALC888S Microphone + Headphone Combo Connector (TRRS) Pre-amplified stereo Speaker Connectors (up to 3W) Digital Optical audio S\/PDIF and analog stereo output combo jack 3.5mm connector 2x USB 3.0 type-A sockets 2x USB Type-C : USB 3.1 DisplayPort Alternate Mode Dual Role Port (DRP) USB Power Delivery (USB-PD) 3.0 Embedded Controller I\/O : 2x UART ports* 2x I2C interface* 1x SPI interface* 1x Keyboard Scan interface* 1x FAN Controller* up to 10x GPIO Power In: 19V DC Power Jack at least 3A. USB Type-C power in. PD sink profile 20V\/3A(60W). RTC Battery Connector + RTC Coin Battery Bi-color Power Status LED Arduino™ Leonardo-Compatible I\/O : 12x analog inputs* up to 23x digital input\/output (7 PWM)* 1x UART 1x I2C 1x SPI* 3x Grove connectors: 1x ANALOG INPUT, 1x UART or DIGITAL I\/O, 1x I2C or DIGITAL I\/O Dimensions: 12cm x 12cm - 4.72” x 4.72” *Available on Pin Headers Visit the official accessories sections. Community Official web site www.udoo.org Official web site dedicated page: tbu Official forum www.udoo.org\/forum Forums The official UDOO forums can be found at www.udoo.org\/forum The forum search facility has been tweaked to allow more general searching. Please do a search before making a post as the issue may already have been raised and answered. IRC channel There is an (unofficial) UDOO discussion channel on IRC. Using the IRC client of your choice, use server information: irc.freenode.net. Room name is #udoo. Social networks Facebook fan page Twitter Google+ YouTube Instagram","tags":"","url":"Introduction\/Introduction.html"},{"title":"Linux","text":"UDOO BOLT is a Single Board Computer based on the AMD Ryzen™ Embedded V1000 family of System-on-Chips (SoCs), a series of Dual or Quad Core, 14nm, SoCs with 64-bit instruction set and very low TDP. Thanks to the x86_64 instruction set, the UDOO BOLT supports all the x86 Linux distribution for 32-bit(aka i386, IA-32, x86-32, x86_32) and 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit OS version. Heads up! Please notice that usually you need a 64-bit OS version to exploit more than 4GB of RAM. Total amount of memory available with a 32-bit OS depends on the OS itself (usually less than 4GB unless the OS isn't using PAE). In the Getting Started section you can find a guide of how to install a Linux distro, the example is based on the Ubuntu OS. In order to download the latest stable updated versions of the AMD Ryzen™ drivers for the v1000 Embedded Series processors you can visit this page: V-Series V1000 Drivers &amp; Support | AMD . The OS supported by these drivers in the Linux x86_64 version is Ubuntu 18.04.1 LTS. In the package you can find a User Manual with instructions to know how to install the drivers. You can use also the standard open source drivers contained in the Linux Kernel but some of the graphical features (Libdrm, Mesa, Ddx, Gstomx, LLVM, Vulkan, ROCm) may not work as expected. Heads up! The AMD processors of the UDOO BOLT and the Wi-Fi\/BT module are released only few time ago so we suggest to use a recent distribution to find all the latest drivers already installed and all working properly. Famous Linux distributions Here you can find an unordered list of 10 of the most popular Linux distributions: Ubuntu: is probably the most well-known Linux distribution. Ubuntu is based on Debian, but it has its own software repositories. Much of the software in these repositories is synced from Debian’s repositories. Ubuntu 18.10 Cosmic Cuttlefish is the latest Ubuntu released version. Ubuntu 18.04 LTS Bionic Beaver is the latest Long Term Support version with a support end of life on April 2023. In the V-Series V1000 Drivers &amp; Support | AMD page you can find AMD stable drivers to support Ubuntu 18.04.1 LTS. Linux Mint is a Linux distribution built on top of Ubuntu. It uses Ubuntu’s software repositories, so the same packages are available on both. Originally, Mint was an alternative distribution loved mainly because it included media codecs and proprietary software that Ubuntu didn’t include by default. Debian is an operating system composed only of free, open-source software. The Debian project has been operating since 1993 — over 20 years ago! This widely respected project is still releasing new versions of Debian, but it’s known for moving much more slowly than distributions like Ubuntu or Linux Mint. This can make it more stable and conservative, which is ideal for some systems. Arch Linux is more old school than many of the other Linux distributions here. It’s designed to be flexible, lightweight, minimal, and to “Keep it Simple.” Keeping it simple doesn’t mean Arch provides tons of graphical utilities and automatic configuration scripts to help you set up your system. Instead, it means Arch dispenses with that stuff and gets out of your way. Fedora is a project with a strong focus on free software — you won’t find an easy way to install proprietary graphics drivers here, although third-party repositories are available. Fedora is bleeding edge and contains the latest versions of software. CentOS \/ Red Hat Enterprise Linux Red Hat Enterprise Linux is a commercial Linux distribution intended for servers and workstations. It’s based on the open-source Fedora project, but is designed to be a stable platform with long-term support. CentOS and Red Hat recently announced they’re collaborating, so CentOS is now part of Red Hat itself. openSUSE \/ SUSE Linux Enterprise openSUSE is a community-created Linux distribution sponsored by Novell. Novell purchased SuSE Linux in 2003, and they still create an enterprise Linux project known as SUSE Linux Enterprise. Where Red Hat has the Fedora project that feeds into Red Hat Enterprise Linux, Novell has the openSUSE project that feeds into SUSE Linux Enterprise. Mageia \/ Mandriva Mageia is a fork of Mandriva Linux created in 2011. Mandriva — known as Mandrake before that — was once one of the great user-friendly Linux distributions. Slackware Linux is another institution. Founded in 1993, Slackware is the oldest Linux distribution that’s still maintained and putting out new releases today. Puppy Linux is another fairly well-known Linux distribution. Previous versions have been built on Ubuntu, but the latest is built on Slackware. Puppy is designed to be a small, lightweight operating system that can run well on very old computers. Others useful distributions: LibreELEC – Just enough OS for KODI Kodi is a free and open-source media player software application developed by the XBMC Foundation. LibreELEC (short for Libre Embedded Linux Entertainment Center) is a distro based on Kodi, is a non-profit fork of OpenELEC as an open source just enough OS (JeOS) Linux software appliance distro for Kodi. Lakka is a lightweight Linux distribution that transforms a computer into a full blown game console for retrogaming. source www.howtogeek.com To help choosing your favorite distro you can also check this linux.org article. A very updated resource to watch &quot;which is the most used Linux Distro&quot; and to choose one is Distro Watch","tags":"","url":"Software_&_OS_Distro\/Linux.html"},{"title":"Windows","text":"UDOO BOLT is a Single Board Computer based on the AMD Ryzen™ Embedded V1000 family of System-on-Chips (SoCs), a series of Dual or Quad Core, 14nm, SoCs with 64-bit instruction set and very low TDP. Thanks to the x86_64 instruction set, the UDOO BOLT supports the Windows 10 distribution for 32-bit(aka i386, IA-32, x86-32, x86_32) and 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit Windows 10 version. Heads up! Please notice that usually you need a 64-bit OS version to exploit more than 4GB of RAM. Total amount of memory available with a 32-bit OS depends on the OS itself (less than 4GB, however). If you installed more than 4GB, please use a 64-bit version of Windows 10. In the Getting Started section you can find a guide of how to install Windows, the example is based on Windows® 10 64-bit. Heads up! The AMD processors of the UDOO BOLT are released only few time ago so we suggest to keep always updated the Windows® 10 64-bit version installed and the AMD drivers to have all the features working properly. In order to download the latest stable updated versions of the AMD Ryzen™ drivers for the v1000 Embedded Series processors you can visit this page: V-Series V1000 Drivers &amp; Support | AMD . You can find the AMD Catalyst Windows® 64-bit Display Driver for Windows 10 (64-Bit Edition). Install the latest software to exploit all the functionalities of the AMD RX Vega GPU.","tags":"","url":"Software_&_OS_Distro\/Windows.html"},{"title":"Official Accessories","text":"In the UDOO Shop you can also find some accessories for the UDOO X86. M.2 Modules M.2 SSD Transcend MTS600 2260 Buy it from the shop Capacity: 128GB\/256GB\/512GB Dimensions: 60.0mm × 22.0mm × 3.58mm (2.36&quot; x 0.87&quot; x 0.14&quot;) Weight: 6g (0.21 oz) Storage Media: MLC NAND Flash memory Operating Voltage: DC 3.3V±5% Operating Temperature: 0°C (32°F) to 70°C (158°F) For more info about this SSD module you can check the official Transcend page To mount the SSD is necessary the following fixtures (included with the board): 1x M3x12mm Screw M.2 Wi-Fi Intel dual band ac Wi-Fi + BT 4.2 5GHz + adhesive antenna Buy it from the shop The package includes: Wi-Fi AC and Bluetooth 4.2 module Intel® Dual Band Wireless Wi-Fi AC and Bluetooth 4.2 module (AC3168) Dimensions: 4.9 x 3.5 x 0.4 inches Weight: 8.5g (0.3 oz) M.2 compatible RF micro coax type connector 2x Antennas U.FL\/IPEX connector 10cm IPEX cable Adhesive backing on aerial plates For more info about this WiFi\/BT module you can check the datasheet from the Intel website Heads up! Intel® Dual Band Wireless Wi-Fi AC and Bluetooth 4.2 module (Intel® AC3168) was released in 2016 so we suggest to use a recent distribution to find the latest drivers already installed. If you are using a Linux distribution you need at least the v4.6 of the Linux Kernel to make this module work properly. Heads up! You need both the antennas to make the module works properly. Connect an antenna to the Main A connector to enhance Wi-Fi signal. Connect an antenna to the Aux B connector to enhance Bluetooth and BluetoothLE signal. To mount the WiFi\/BT Kit is necessary the following fixtures (included with the board): 1x M3x8mm Flat Head Screw M.2 dual Ethernet Module Kit Buy it from the shop This module is based on 2x Realtek 8111GS Ethernet controllers (fully compliant with IEEE 802.3, IEEE 802.3u, IEEE 802.3ab). When the M.2 dual Ethernet Module Kit accessory is plugged into M.2 Key B slot, the UDOO X86 board will offer three different Gigabit Ethernet ports. To mount the M.2 dual Ethernet Module Kit is necessary the following fixtures (included with the board): 1x M3x12mm Screw Mounting a M.2 accessory Mount the M.2 devices with the same metal screws that you find with the board when you purchased it. If the screws are no longer available, take care to use a metal one with the same characteristics as the one supplied. Displays 7inch HDMI\/USB Display\/Touch Buy it from the shop The 7inch HDMI\/USB Display\/Touch has a 1024×600 pixel resolution and is supported by Windows 10\/8.1\/8\/7, Linux, and Android Operating System Display Features: 1024×600 high resolution; Resistive touch control; Compatible and Direct-connect with UDOO X86 with Windows 10\/8.1\/8\/7, Linux and Android operating system; Also works as a computer monitor, in this case, touch panel is unavailable and HDMI cable is required; HDMI interface for displaying, no I\/Os required (however, the touch panel still needs I\/Os); Multi-languages OSD menu, for power management, brightness adjustment, contrast adjustment, etc; Supports 100-level backlight adjustment. To use it just: 1- Turn On the “backlight” switch on the back of the LCD; 2- Connect the Touch ports on your UDOO. The device will be recognized automatically; 3- Connect the HDMI port of the LCD to the HDMI port on your UDOO with an HDMI cable. Heads up! When multiple displays are detected by your UDOO, the LCD can only be used to control the cursor on main displays. So it is proposed to set the LCD as the main display. If you're looking for more info about this screen you can check the wiki page of the manufacturer: 7inch_HDMI_LCD_(C) Cases Metal Case Buy it from the shop A beautiful metal case for your UDOO BOLT. Heads up! Please notice that the case does not dissipate heat itself, but it allow the airflow to dissipate the board properly using the processor fan. Check here the mechanical drawing to see the dimensions of the case. UDOO BOLT METAL CASE includes: 1x Sheet Metal Internal Part; 1x Extruded Metal external Part; 1x kit with screws, rubber feet, ecc.; The case features also two holes, in the back side, for connecting externally the WiFi and BT antennas of the M.2 module through a RP-SMA connector. For example you can use 2x U.FL\/IPEX to RP-SMA cables and 2x RP-SMA antennas like in the following image. Heads up! These items are not included. Cables and Others Cables and Power Supply HDMI to HDMI - HDMI A Male to A Male Cable 2MT: Supports Ethernet, 3D, 4K video and Audio Return Channel (ARC) SATA data and power cables for UDOO X86 - SATA data and power cables for UDOO BOLT (CN18 and CN30 connectors) Power Supply EU 19V 3.42A for UDOO BOLT - Input: 100-240VAC 50\/60Hz Output: 19V 3.42A DC Output plug: 4.5mm * 3mm * 10mm","tags":"","url":"Hardware_&_Accessories\/Official_Accessories.html"},{"title":"Overview","text":"TOP AND BOTTOM VIEWS BLOCK DIAGRAM FULL SPECS AMD RYZEN™ EMBEDDED V1000 SOC Processor AMD Ryzen™ Embedded V1000 (V1605B - V1202B) series up to 3.6GHz in Boost mode Core Core Up to Quad Core\/Eight Thread Memory 2x Slot SO-DIMM Dual-channel 64-bit DDR4 2400 MT\/s with ECC support up to 32GB Graphics Up to AMD Radeon™ Vega 8 Graphics (8 GPU CU) Multimedia DirectX® 12 Technology, OpenCL, OpenGL, The Vulkan® APIH.265 Decode &amp; (8-bit) Encode, VP9 Decode Video Interfaces 2x HDMI 1.4 \/ 2.0a 2x DP Alternate Mode on USB Type-C Mass Storage eMMC 5.0 High Speed Drive 32 GB soldered on boardSATA III 6Gbit\/s standard connectorSSD SATA module's Slot M.2 Socket 2 Key B 2260 (featured also PCI-e x2)NVMe modules Slot M.2 Socket 3 Key M 2280 (PCI-e x4 Gen 3 interface) Networking Gigabit Ethernet Realtek RTL8111GSlot M.2 Socket 1 Key E 2230 for optional WiFi\/BT combo USB 2x USB 3 Type-A 2x USB Type-C: - USB 3.1 - DisplayPort Alternate Mode - Dual Role Port (DRP) USB Power Delivery (USB-PD) 3.0 Audio HD Audio Codec Realtek ALC888SMicrophone + Headphone Combo Connector (TRRS)Pre-amplified stereo Speaker Connectors (up to 3W)Digital Optical audio S\/PDIF and analog stereo output combo jack 3.5mm connector Other Interfaces Front Panel Headers, IR receiver (RC5 compatible), Fan controller, RTC battery included Embedded Controller I\/O Pins 2x UART, 2x I2C, 1x SPI, 1x Keyboard Scan, 1x FAN Controller, 10x GPIO Operating System Windows 10 64bitAny Linux Distribution for x86_64bit Board Dimensions 12cm x 12cm - 4.72” x 4.72” - Nano-ITX standard form factor ATMEL® ATMEGA32U4 MICROCONTROLLER Microcontroller Atmel® ATmega32U4 module Other Interfaces SPI Flash JTAG connector Arduino Pinout Easy to use with a custom 2 rows pinoutExpandable with I\/O shield to have the standard Arduino Pinour R3 Digital I\/O Pins up to 23x digital input\/output (7 PWM) Analog I\/O Pins 12 (10 Bits of resolution) Heads up! The communication between the AMD Ryzen™ Embedded V1000 SOC and the Atmel® ATmega32U4 module come through a USB interface, exactly like an Arduino™ Leonardo board connects to an external PC.","tags":"","url":"Hardware_Reference\/Overview.html"},{"title":"Resources","text":"UDOO X86 Hardware and UEFI BIOS User Manual For a complete explanation of the UDOO BOLT hardware you can download the UDOO BOLT Hardware and UEFI User Manual Schematics Here you can find the schematics files of the UDOO BOLT: Schematics Top Bottom Bill of Material (BOM) Here you can find the Bill of Materials(BOM) file of the UDOO X86: Bill of Material (BOM) Mechanical Specs - 3D Design Files Here you can find the mechanical specs files of the UDOO X86: UDOO BOLT 3D Design File UDOO BOLT Metal Case drawings. Gerber Files","tags":"","url":"Hardware_Reference\/Resources.html"},{"title":"Board versions","text":"The only difference between the two versions of the UDOO BOLT (V8 and V3) is the AMD APU version. The main differences between the two versions of the AMD Ryzen™ v1000 Embedded APU are shown in the following table. V8 V3 Processor AMD Ryzen™ Embedded V1605B AMD Ryzen™ Embedded V1202B CPU Cores 4 Cores \/ 8 Threads 2 Cores \/ 4 Threads CPU Freq (Base\/Max) 2GHz \/ 3.6GHz 2.3GHz \/ 3.2GHz GPU AMD Radeon™ Vega 8 Graphics AMD Radeon™ Vega 3 Graphics GPU Max 1100 MHz 1000 MHz GPU CU 8 3 For a detailed comparison of the two processors follow this link: Processors specifications table For other info about the AMD Ryzen™ Embedded Processors series follow this link: AMD Ryzen™ Embedded Processors series","tags":"","url":"Hardware_Reference\/Board_versions.html"},{"title":"Storage Options","text":"eMMC onboard UDOO BOLT features an embedded multi media card memory of 32GB. The eMMC use a e.MMC 5.1 HS400 compliant interface. Heads up! As a flash-based storage device, excessive drive access, particularly write commands, reduces its useful life. Therefore, it is strongly suggested to NOT create a swap partition on the eMMC device. SATA The AMD Ryzen™ Embedded V1000 family of Processors embed a SATA Controller, which offers two SATA III 6.0 Gbps interfaces. Of these interfaces, one SATA channel is carried out to a standard male S-ATA connector, CN14 (the other SATA channel is available on the M.2 Key B socket). A dedicated power connector CN15, can be used to give supply to 2.5&quot; Hard Disk Drives (or Solid State Drives) connected to the SATA male connector. The dedicated power connector is a 4-pin male connector. You can find this cable in the SATA data and power cables kit. Heads up! To connect a 3.5&quot; Hard Drive you need to provide SATA +5V+12V combo power supply from an external source. M.2 SATA\/PCI-e x2 Slot: Socket 2 Key B type 2242\/3042\/2260 The mass storage capabilities of the UDOO BOLT are completed by an M.2 SSD Slot, which allow plugging M.2 Socket 2 Key B Solid State Drives with SATA interface or PCI-e x2 interface (PCI-e x1 is also supported). The connector used for the M.2 SATA\/PCI-e slot is CN18, which is a standard 75 pin M.2 Key B connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA\/PCI-e modules in 2260 size. It is possible to place also modules in 2242 and 3042 size, by using a M\/F Spacer which allows fixing the M.2 module on the spacer already available on the PCB, deemed for the fixing of the M.2 Wireless module. In the Official Accessories section you can find a M.2 SSD Transcend MTS600 2260 drive compatible with this connector, available in the UDOO shop. M.2 NVMe Slot: Socket 3 Key M Type 2280 Another possibility for connecting mass storage devices is given by the M.2 Key M Slot, which allows the plugging of M.2 High Capacity SSD NVMe drives with PCI-e x4 interface. The connector used for the M.2 SSD slot is CN17, which is a standard 75 pin M.2 Key M connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 3 Key M PCI-e SSD modules in 2280 size.","tags":"","url":"Hardware_Reference\/Storage_Options.html"},{"title":"M.2 Connectors","text":"UDOO X86 features two M.2 connectors on the bottom of the board. M.2 SATA\/PCI-e Slot: Socket 2 Key B type 2242\/3042\/2260 The mass storage capabilities of the UDOO X86 are completed by an M.2 SSD Slot, which allow plugging M.2 Socket 2 Key B Solid State Drives with SATA interface or PCI-e x2 interface (PCI-e x1 is also supported). The connector used for the M.2 SATA\/PCI-e slot is CN20, which is a standard 75 pin M.2 Key B connector, type LOTES p\/n APCI0087-P001A, H=8.5mm. On the UDOO X86 board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA\/PCI-e modules in 2260 size. In the Official Accessories section you can find a M.2 SSD Transcend MTS600 2260 drive compatible with this connector, available in the UDOO shop. It is possible to place also modules in 2242 or 3042 size, by using a M\/F Spacer which allows fixing the M.2 module on the spacer already available on the PCB, deemed for the fixing of the M.2 Key E. The PCI-e x2 interface can be used also for different purposes other than SSD modules, but it is important that the CONFIG_1 signal is driven properly (it can be left unconnected on PCI-e based modules, due to the presence of the pull-up resistor on the platform). For example you can connect other accessories as the official M.2 dual Ethernet Module Kit or an adapter from M.2 to PCI-e 2x as used in this project to connect an external GPU. M.2 NVMe Slot: Socket 3 Key M Type 2280 Another possibility for connecting mass storage devices is given by the M.2 Key M Slot, which allows the plugging of M.2 High Capacity SSD NVMe drives with PCI-e x4 interface. The connector used for the M.2 SSD slot is CN17, which is a standard 75 pin M.2 Key M connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 3 Key M PCI-e SSD modules in 2280 size. Searching in the web you can also find M.2 to PCI-e 4x to connect an external GPU. These unofficial accessories are not supported by UDOO. M.2 Connectivity Slot: Socket 1 Key E Type 2230 It is possible to increase the connectivity of the UDOO X86 board by using M.2 Socket 1 Key E connectivity modules (i.e. modules with functionalities like WiFi + Bluetooth). The connector used for the M.2 Connectivity slot is CN19, which is a standard 75 pin M.2 Key E connector, type LOTES p\/n APCI0076-P001A, H=4.2mm, with the pinout shown in the table on the left. On the UDOO X86 board there is also a Threaded Spacer which allows the placement of M.2 Socket 1 Key E connectivity modules in 2230 size. In the Official Accessories section you can find a M.2 Wi-Fi Intel dual band ac Wi-Fi + BT 4.2 5ghz + adhesive antenna module compatible with this connector, available in the UDOO shop.","tags":"","url":"Hardware_Reference\/M.2_Connectors.html"}]}